api_id = 25965329 #24364263
api_hash = "6604012087bc1273f1f918571c02af24" #"1f03c4f0e8617dd5fe4f16e9d629f47c"

#каналы которые слушаем#
channels_to_listen = {
    4593819858: { #InterTest2
        'moderation_if_image': True,
        'auto_send_text_message': True,
        'replacements': { 
            'слово1': 'замена1', #что на что меняем#
            'слово2': 'замена2',
            'слово3': 'замена3',
            'слово4': 'замена4',
        }
    },
    2204843457: {#InterTest
        'moderation_if_image': True,
        'auto_send_text_message': True,
        'replacements': {
            'слово1': 'замена1',
            'слово2': 'замена2',
            'слово3': 'замена3',
            'слово4': 'замена4',
        }
    },
    # 1242446516: {#Україна 24/7
    #     'moderation_if_image': True,
    #     'auto_send_text_message': True,
    #     'replacements': {
    #         'слово1': 'замена1',
    #         'слово2': 'замена2',
    #         'слово3': 'замена3',
    #         'слово4': 'замена4',
    #     }
    # },
    4517954004: {#InterTest
        'moderation_if_image': True,
        'auto_send_text_message': True,
        'replacements': {
            'слово1': 'замена1',
            'слово2': 'замена2',
            'слово3': 'замена3',
            'слово4': 'замена4',
        }
    },
    # 1229342507: { #КЛИЕНТЫ || РАБОТА ОНЛАЙН
    #     'moderation_if_image': True,
    #     'auto_send_text_message': True,
    #     'replacements': {
    #         'ебнутый': 'ненормальный',
    #         'ХУЙЛ': 'дебил',
    #         'хуй': 'лингам',
    #         'жоп': 'дупа',
    #         'отсос': 'обслужен',
    #         'хуе': 'лингам',
    #         'Себал': 'отвалил',
    #         'ебало': 'фейс',
    #         'очкуешь': 'дрейфишь',
    #         'хули': 'зачем',
    #         'пидор': 'гей',
    #         'выеб': 'изнасиловать',
    #         'подсос': 'залежність',
    #         'разъеб': 'унизит',
    #         'підари': 'геі',
    #         'блядина': 'гуляща',
    #     },
    # },
    2023070684: { #Crypto Master | Futures Signals
        'moderation_if_image': False,
        'auto_send_text_message': True, #если это значение труе то будет производить автозамену и отсылать, если фэлз будет делать автозамену и отсылать на сайт человеку
        'replacements': {
            'bingx.com': 'ссылка на мой сайт',
            '@SamCrypto_Master': '@мойник',
           
        },
        
    },
}


#каналы куда отсылаем#
channels_to_send = [2170620330]
