#каналы которые слушаем#
channels_to_listen = {
    4593819858: { #айди канала смотреть на специальной страницестранице#
        'moderation_if_image': True,
        'replacements': { 
            'слово1': 'замена1', #что на что меняем#
            'слово2': 'замена2',
            'слово3': 'замена3',
            'слово4': 'замена4',
        }
    },
    2204843457: {
        'moderation_if_image': True,
        'replacements': {
            'слово1': 'замена1',
            'слово2': 'замена2',
            'слово3': 'замена3',
            'слово4': 'замена4',
        }
    },
    1242446516: {
        'moderation_if_image': True,
        'replacements': {
            'слово1': 'замена1',
            'слово2': 'замена2',
            'слово3': 'замена3',
            'слово4': 'замена4',
        }
    },
    4517954004: {
        'moderation_if_image': True,
        'replacements': {
            'слово1': 'замена1',
            'слово2': 'замена2',
            'слово3': 'замена3',
            'слово4': 'замена4',
        }
    },
    1229342507: { #1363028986
        'moderation_if_image': True,
        'replacements': {
            'ебнутый': 'ненормальный',
            'ХУЙЛ': 'дебил',
            'хуй': 'лингам',
            'жоп': 'дупа',
            'отсос': 'обслужен',
            'хуе': 'лингам',
            'Себал': 'отвалил',
            'ебало': 'фейс',
            'очкуешь': 'дрейфишь',
            'хули': 'зачем',
            'пидор': 'гей',
            'выеб': 'изнасиловать',
            'подсос': 'залежність',
            'разъеб': 'унизит',
            'підари': 'геі',
            'блядина': 'гуляща',
        },
    },
    2023070684: { 
        'moderation_if_image': True,
        'replacements': {
            'bingx.com': 'ссылка на мой сайт',
            '@SamCrypto_Master': '@мойник',
            'хуй': 'лингам',
            'жоп': 'дупа',
            'отсос': 'обслужен',
            'хуе': 'лингам',
            'Себал': 'отвалил',
            'ебало': 'фейс',
            'очкуешь': 'дрейфишь',
            'хули': 'зачем',
            'пидор': 'гей',
            'выеб': 'изнасиловать',
            'подсос': 'залежність',
            'разъеб': 'унизит',
            'підари': 'геі',
            'блядина': 'гуляща',
        },
        
    },
}


#каналы куда отсылаем#
channels_to_send = [2170620330]
