
channels_to_listen = {
    4593819858: {
        'moderation_if_image': True,
        'replacements': {
            'слово1': 'замена1',
            'слово2': 'замена2',
            'слово3': 'замена3',
            'слово4': 'замена4',
        }
    },
    2204843457: {
        'moderation_if_image': True,
        'replacements': {
            'слово1': 'замена1',
            'слово2': 'замена2',
            'слово3': 'замена3',
            'слово4': 'замена4',
        }
    },
    1242446516: {
        'moderation_if_image': True,
        'replacements': {
            'слово1': 'замена1',
            'слово2': 'замена2',
            'слово3': 'замена3',
            'слово4': 'замена4',
        }
    },
    4517954004: {
        'moderation_if_image': True,
        'replacements': {
            'слово1': 'замена1',
            'слово2': 'замена2',
            'слово3': 'замена3',
            'слово4': 'замена4',
        }
    },
    1363028986: {
        'moderation_if_image': True,
        'replacements': {
            'слово1': 'замена1',
            'слово2': 'замена2',
            'слово3': 'замена3',
            'слово4': 'замена4',
        }
    },
}

channels_to_send = ['@MuntyanValery']
